
print(5 & 3 == 1)
# 0101
# 0011
# 0001 == 1

print(5 | 3 == 7)
# 0101
# 0011
# 0111 == 7

print(5 ^ 3 == 6)
# 0101
# 0011
# 0110 == 6

print(12 & 10 == 8)
# 1100
# 1010
# 1010 == 8

print(12 | 10 == 14)
# 1100
# 1010
# 1110 == 14

print(12 ^ 10 == 6)
# 1100
# 1010
# 0110 == 6

print(~8 == -9)
# 00001000
# 11110111 == -9

print(5 << 2 == 20)
# 0101
# 0 10100 == 20
#  168421

print(20 >> 2 == 5)
# 10100
# 00101 == 5

# Окремо поясніть, чому ~5 у Python дорівнює -6, а не 2 або іншому невід'ємному числу.  5 = ...00000101
# В пайтоні числа мають нескінчено 0 і перший відповідає за відємне число (-128)
# ~ інвертує ці нулі і нуль зліва стає 1 ( ...11111010 ) що в розрахунку дає -6
# 2 вийшло би якби інвертувались тільки перші три біти