def factorial(n):
    if n == 0:
        return 1
    return n * factorial(n - 1)

factorial(5)

# ВЕРХ СТЕКУ
# ┌────────────────────┐
# │ factorial(0)       │  поверне 1
# ├────────────────────┤
# │ factorial(1)       │  чекає результату
# ├────────────────────┤
# │ factorial(2)       │  чекає результату
# ├────────────────────┤
# │ factorial(3)       │  чекає результату
# ├────────────────────┤
# │ factorial(4)       │  чекає результату
# ├────────────────────┤
# │ factorial(5)       │  чекає результату
# └────────────────────┘
# НИЗ СТЕКУ

# factorial(0) = 1
#        |
#        v
# factorial(1) = 1 * 1 = 1
#        |
#        v
# factorial(2) = 2 * 1 = 2
#        |
#        v
# factorial(3) = 3 * 2 = 6
#        |
#        v
# factorial(4) = 4 * 6 = 24
#        |
#        v
# factorial(5) = 5 * 24 = 120